create_clock -period 100.000 -name clk -waveform {0.000 50.000} [get_ports clk]
set_input_delay -clock [get_clocks clk] -min -add_delay 25.000 [get_ports in_valid]
set_input_delay -clock [get_clocks clk] -max -add_delay 85.000 [get_ports in_valid]
set_input_delay -clock [get_clocks clk] -min -add_delay 15.000 [get_ports res_n]
set_input_delay -clock [get_clocks clk] -max -add_delay 45.000 [get_ports res_n]
set_output_delay -clock [get_clocks clk] -min -add_delay -10.000 [get_ports {out_data[0][*]}]
set_output_delay -clock [get_clocks clk] -max -add_delay 50.000 [get_ports {out_data[0][*]}]
set_output_delay -clock [get_clocks clk] -min -add_delay -10.000 [get_ports {out_data[1][*]}]
set_output_delay -clock [get_clocks clk] -max -add_delay 50.000 [get_ports {out_data[1][*]}]
set_output_delay -clock [get_clocks clk] -min -add_delay -10.000 [get_ports {out_data[2][*]}]
set_output_delay -clock [get_clocks clk] -max -add_delay 50.000 [get_ports {out_data[2][*]}]
set_output_delay -clock [get_clocks clk] -min -add_delay -10.000 [get_ports {out_data[3][*]}]
set_output_delay -clock [get_clocks clk] -max -add_delay 50.000 [get_ports {out_data[3][*]}]
set_output_delay -clock [get_clocks clk] -min -add_delay -10.000 [get_ports {out_data[4][*]}]
set_output_delay -clock [get_clocks clk] -max -add_delay 50.000 [get_ports {out_data[4][*]}]
set_output_delay -clock [get_clocks clk] -min -add_delay -10.000 [get_ports {out_data[5][*]}]
set_output_delay -clock [get_clocks clk] -max -add_delay 50.000 [get_ports {out_data[5][*]}]
set_output_delay -clock [get_clocks clk] -min -add_delay -10.000 [get_ports out_done]
set_output_delay -clock [get_clocks clk] -max -add_delay 50.000 [get_ports out_done]
set_output_delay -clock [get_clocks clk] -min -add_delay -10.000 [get_ports out_ready]
set_output_delay -clock [get_clocks clk] -max -add_delay 50.000 [get_ports out_ready]
set_output_delay -clock [get_clocks clk] -min -add_delay -10.000 [get_ports out_valid]
set_output_delay -clock [get_clocks clk] -max -add_delay 50.000 [get_ports out_valid]
